package ru.spbstu.application.telegram


object Strings {
    val Avatars = arrayOf("Ж","М","DigitalAgile")
    val Occupations = arrayOf("Бакалавриат 1 курс","Бакалавриат 2 курс","Бакалавриат 3 курс","Бакалавриат 4 курс", "Магистратура 1 курс","Магистратура 2 курс","У меня уже есть свой бизнес!","Работаю по найму","Студент")

    const val WelcomeRequirePhone = "Привет, меня зовут UniStart, и я буду с тобой на протяжении всего, надеюсь, увлекательного и успешного пути по развитию собственной идеи до реального бизнеса! Для начала давай ты укажешь свой номер, чтобы получить доступ"
    const val SendPhoneButton = "Отправить номер телефона"
    const val NoPhoneInDataBase="Упс, что-то пошло не так, твоего номера нет в системе, пожалуйста обратись к администратору"
    const val ChooseAvatar = "Отлично, мы в деле! Давай теперь ты выберешь мне аватар"
    const val ChooseOccupation = "Теперь давай познакомимся. Для начала, ты сейчас:"
    const val ChooseCourse = "Круто! Это отличное время для старта! А на каком курсе ты учишься?"
    const val HaveAlreadyHadIdea = "У тебя уже есть своя идея?"
    const val SuperIdea="Да, хочу как следует ее прокачать!!!"
    const val NotMyIdea="Да, не моя, но я в команде и хочу как следует ее прокачать!!!"
    const val NoIdea="Нет, но хочу погенерить и стартануть предпринимателем!"
    const val SoSoIdea="Вроде есть, но хочу еще погенерить и стартануть предпринимателем!"
    const val StartWithSecondStep="Отлично! Ты стартуешь со второго шага, так как первый - генерация идей у тебя уже пройден. Но если ты захочешь пройти первый шаг, он тебе уже доступен и можешь выбрать и начать с него. По мере прохождения нашего пути тебе будут открываться новые шаги, но ты всегда сможешь вернуться и пройти все, которые ты уже проходил, ведь движение в бизнесе не только прямолинейно)))"
    const val StartWithFirstStep = "Отлично! Делаем первый шаг! По мере прохождения нашего пути тебе будут открываться новые шаги, но ты всегда сможешь вернуться и пройти все, которые ты уже проходил, ведь движение в бизнесе не только прямолинейно)))"

}
